{
  "Duvidas": {
    "Componente de classe está deprecated?":"Não. Projetos novos não usam mais classes, mas os antigos podem continuar, eventualmente as classes vão desaparecer.",
    "Por que aprender classes se elas estão quase legadas?":"Pra manter código legado. A única outra exceção é tratar error boundaries.",
    "O que é escopo léxico?":"É quando acessamos o escopo usando keywords como this.",
    "Qual é o fluxo de dados do react?":"Unidirecional, do parent para os children",
    "Os lifecycles como componentwillreceiveprops, e outros, estão deprecados?":"Sim",
    "Prop.types está deprecado. O que foi lançado pra substituir?":"Os devs usam typescript interface pra substituir o prop types do react. Mas o pacote proptypes que foi deprecado foi descolado do react padrão, e agora precisa ser instalado a parte. yarn add prop-types. A sintaxe também mudou segue a documentação de como usar agora: https://reactjs.org/docs/typechecking-with-proptypes.html",
    "Qual a sintaxe correta pra acessar o estado com class components?":"No functional components a gente acessa direto. No class é assim: value={this.state.value}",
    "O que são controled components?":"São componentes que a gente usa onChange + state pra gerenciar o estado.",
    "O que são uncontroled components?":"É quando ao invés de usar onChange + state, a gente deixa como um elemento html puro. Exemplo: <input /> desta forma o html gerencia o estado no proprio input. Mas a gente não consegue acessar o target.value dele.",
    "Como criar um uncontroled component que tenha valor inicial?":"usando a prop do html defaultValue. Dificilmente vais usar. Mas é assim. ",
    "O que substituiu o 'use strict' do react antigo?":"A tag React.StrictMode. Agora vc usa ela uma vez só no index.js ao invés de escrever ela no topo de todos os arquivos",
    "Na vida real, porque configurar o webpack e todo o boilerplate na mão, se a gente pode usar create-react-app, e outros clis?":"",
    "Posso fazer meu react app com create-react-app, e depois buildar ele direto conforme fala a documentação ou precisa fazer de outra forma?":"",
    "Como usar configurar e default props no meu componente?":"",
    "Como ter pleno domínio dos 3 lifecycles usando useEffect?":"",
    "Qual o sentido de aprender a manipular o dom diretamente com JS, se em produção usamos apenas react, e outros frameworks que não permitem isso?":"",
    "Como implementar currying, compose de programação funcional no meu projeto react?":"",
    "":""
  },
  "Not related": {
    "Como hospedar mongoDB na digital ocean? Vale a pena?":"",
    "Como hospedar node.js na digital ocean? Vale a pena?":"",
    "Como conectar front, back e banco em produção? (MERN)":"",
    "O vue.js é escrito com classes ou hooks?": ""
  }
}